#Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
#Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя 
#делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

p=int(input('введите произведение загаданных чисел'))
s=int(input('введите сумму загаданных чисел'))
is_find = False

for i in range (0, 1001):
    for j in range (0,1001):
        if (i*j==p) and (i+j==s):
            print(i,j)
            is_find = True
            break
    if is_find:
        break


